import sys
if __name__ == '__main__':
    m = int(input('Введите номер месяца: '))

    if m == 1:
        print('Первое полугодиe, 31 день')
    elif m == 2:
        print("первое полугодие, 28 дней")
    elif m == 3:
        print("первое полугодие, 31 день")
    elif m == 4:
        print("первое полугодие, 30 дней")
    elif m == 5:
        print("первое полугодие, 31 день")
    elif m == 6:
        print("первое полугодие, 30 дней")
    elif m == 7:
        print("второе полугодие, 31 день")
    elif m == 8:
        print("второе полугодие, 31 дней")
    elif m == 9:
        print("второе полугодие, 30 день")
    elif m == 10:
        print("второе полугодие, 31 дней")
    elif m == 11:
        print("второе полугодие, 30 день")
    elif m == 12:
        print("второе полугодие, 31 дней")
    else:
        print("Ошибка!", file=sys.stderr)
        exit(1)


